```
Terraform will perform the following actions:

  # azurerm_kubernetes_cluster_node_pool.infraciarm64 will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "infraciarm64" {
        id                      = "/subscriptions/dff2ec18-6a8e-405c-8e45-b7df7465acf0/resourceGroups/prod-privatek8s/providers/Microsoft.ContainerService/managedClusters/privatek8s-emerging-ram/agentPools/arm64small"
      ~ max_count               = 20 -> 10
        name                    = "arm64small"
        tags                    = {
            "repository" = "jenkins-infra/azure"
            "scope"      = "terraform-managed"
        }
        # (26 unchanged attributes hidden)
    }

  # module.trusted_ci_jenkins_io.azuread_application_password.controller must be replaced
-/+ resource "azuread_application_password" "controller" {
      ~ application_object_id = "e40fa29b-7772-45f8-820e-4ba73689bf7f" -> (known after apply)
      ~ end_date              = "2024-03-08T19:40:35Z" -> "2024-06-09T19:40:35Z" # forces replacement
      ~ id                    = "e40fa29b-7772-45f8-820e-4ba73689bf7f/password/0a5abb3b-f30d-480b-ae7e-d0c77ada1091" -> (known after apply)
      ~ key_id                = "0a5abb3b-f30d-480b-ae7e-d0c77ada1091" -> (known after apply)
      ~ start_date            = "2023-03-08T19:52:10Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
LGTM, self-merging